# Refreshing python dataanalysis
https://www.youtube.com/watch?v=WcDaZ67TVRo

In [1]:
x = [1,2,3]

In [2]:
x

[1, 2, 3]

In [3]:
y = x.copy()

In [4]:
x[2] = -3

In [5]:
y

[1, 2, 3]

In [22]:
ls

PythonSamples/       README.md            interview.py
PythonSamples.ipynb  Rough.ipynb

In [29]:
import pandas as pd
x = pd.read_csv("PythonSamples/StudentsPerformance.csv")

In [30]:
x.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [34]:
x

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Added
0,female,group B,bachelor's degree,standard,none,72,72,74,172
1,female,group C,some college,standard,completed,69,90,88,169
2,female,group B,master's degree,standard,none,90,95,93,190
3,male,group A,associate's degree,free/reduced,none,47,57,44,147
4,male,group C,some college,standard,none,76,78,75,176
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,188
996,male,group C,high school,free/reduced,none,62,55,55,162
997,female,group C,high school,free/reduced,completed,59,71,65,159
998,female,group D,some college,standard,completed,68,78,77,168
999,female,group D,some college,free/reduced,none,77,86,86,177

In [55]:
x['Added'] = x[['math score','writing score']].apply(lambda row: row[0]+row[1],axis=1)

/var/folders/9y/tw1s51192jvcp0qd24b7qq8r0000gn/T/ipykernel_90634/345034512.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  x['Added'] = x[['math score','writing score']].apply(lambda row: row[0]+row[1],axis=1)

In [56]:
x

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Added
0,female,group B,bachelor's degree,standard,none,72,72,74,146
1,female,group C,some college,standard,completed,69,90,88,157
2,female,group B,master's degree,standard,none,90,95,93,183
3,male,group A,associate's degree,free/reduced,none,47,57,44,91
4,male,group C,some college,standard,none,76,78,75,151
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,183
996,male,group C,high school,free/reduced,none,62,55,55,117
997,female,group C,high school,free/reduced,completed,59,71,65,124
998,female,group D,some college,standard,completed,68,78,77,145
999,female,group D,some college,free/reduced,none,77,86,86,163

In [5]:
x = [0,1,0,3,12]

for i in range(len(x)):
    if x[i] == 0:
        x.append(x.pop(i))
    else:
        pass

In [9]:
x

[12, 0, 0]

In [8]:
x.pop(0)

3

In [11]:
if 1:
    print(True)

True

In [12]:
y = {}


x = [1,2,3,2,3,4]

for i in range(len(x)):
    if y.get(x[i], 0):
        y[x[i]] += 1
    else:
        y[x[i]] = 1

In [26]:
y

{1: 1, 2: 2, 3: 2, 4: 1}

In [1]:
x = [1]*10

In [2]:
x

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1]